# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\perforce\kees_KEESCMSLAP2\apps\content\creator\LED_SegDriver\TestBench.cydsn\TestBench.cyprj
# Date: Wed, 10 Oct 2012 22:06:09 GMT
#set_units -time ns
create_clock -name {LED_Refresh_Clock(routed)} -period 2000000 -waveform {0 1000000} [get_pins {ClockBlock/dclk_1}]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {LED_PWM_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 97 193} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {LED_Refresh_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 48001 96001} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for C:\perforce\kees_KEESCMSLAP2\apps\content\creator\LED_SegDriver\TestBench.cydsn\TopDesign\TopDesign.cysch
# Project: C:\perforce\kees_KEESCMSLAP2\apps\content\creator\LED_SegDriver\TestBench.cydsn\TestBench.cyprj
# Date: Wed, 10 Oct 2012 22:06:05 GMT
