# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\vmware-host\Shared Folders\Documents\Github Clones\PSoC.Playground\PROJECTS\Lab3_PWM\Lab3_PWM.cydsn\Lab3_PWM.cyprj
# Date: Thu, 01 Jan 2015 09:21:17 GMT
#set_units -time ns
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {clk} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {clk2} -source [get_pins {ClockBlock/hfclk}] -edges {1 40001 80001} -nominal_period 1666666.6666666665 [list [get_pins {ClockBlock/udb_div_3}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for \\vmware-host\Shared Folders\Documents\Github Clones\PSoC.Playground\PROJECTS\Lab3_PWM\Lab3_PWM.cydsn\TopDesign\TopDesign.cysch
# Project: \\vmware-host\Shared Folders\Documents\Github Clones\PSoC.Playground\PROJECTS\Lab3_PWM\Lab3_PWM.cydsn\Lab3_PWM.cyprj
# Date: Thu, 01 Jan 2015 09:21:02 GMT
