# THIS FILE IS AUTOMATICALLY GENERATED
# Project: Z:\Documents\Github Clones\PSoC.Playground\PROJECTS\7SegDisp\7SegDisp.cydsn\7SegDisp.cyprj
# Date: Fri, 02 Jan 2015 07:28:13 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 9 17} [list]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for Z:\Documents\Github Clones\PSoC.Playground\PROJECTS\7SegDisp\7SegDisp.cydsn\TopDesign\TopDesign.cysch
# Project: Z:\Documents\Github Clones\PSoC.Playground\PROJECTS\7SegDisp\7SegDisp.cydsn\7SegDisp.cyprj
# Date: Fri, 02 Jan 2015 07:27:56 GMT
